OF_Sims/planar_Sims/planarPoiseuille_6dT/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
    {
        type            noSlip;
     
    }
    left
    {
        type            noSlip;
    }
    right
    {
        type            noSlip;
        
    }
    centreline
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            noSlip;
    }
    /* #includeEtc "caseDicts/setConstraintTypes" */
}

// ************************************************************************* //
